ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157axx_ca7.h
/****************  Bit definition for DDRPHYC_DLLGCR register  ****************/
#define DDRPHYC_DLLGCR_DRES_Pos     (0U)
#define DDRPHYC_DLLGCR_DRES_Msk     (0x3U << DDRPHYC_DLLGCR_DRES_Pos)     /*!< 0x00000003 */
#define DDRPHYC_DLLGCR_DRES         DDRPHYC_DLLGCR_DRES_Msk               /*!< Trim reference current versus resistor value variation */
#define DDRPHYC_DLLGCR_DRES_0       (0x1U << DDRPHYC_DLLGCR_DRES_Pos)     /*!< 0x00000001 */
#define DDRPHYC_DLLGCR_DRES_1       (0x2U << DDRPHYC_DLLGCR_DRES_Pos)     /*!< 0x00000002 */
#define DDRPHYC_DLLGCR_IPUMP_Pos    (2U)
#define DDRPHYC_DLLGCR_IPUMP_Msk    (0x7U << DDRPHYC_DLLGCR_IPUMP_Pos)    /*!< 0x0000001C */
#define DDRPHYC_DLLGCR_IPUMP        DDRPHYC_DLLGCR_IPUMP_Msk              /*!< Charge pump current trim */
#define DDRPHYC_DLLGCR_IPUMP_0      (0x1U << DDRPHYC_DLLGCR_IPUMP_Pos)    /*!< 0x00000004 */
#define DDRPHYC_DLLGCR_IPUMP_1      (0x2U << DDRPHYC_DLLGCR_IPUMP_Pos)    /*!< 0x00000008 */
#define DDRPHYC_DLLGCR_IPUMP_2      (0x4U << DDRPHYC_DLLGCR_IPUMP_Pos)    /*!< 0x00000010 */
#define DDRPHYC_DLLGCR_TESTEN_Pos   (5U)
#define DDRPHYC_DLLGCR_TESTEN_Msk   (0x1U << DDRPHYC_DLLGCR_TESTEN_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DLLGCR_TESTEN       DDRPHYC_DLLGCR_TESTEN_Msk             /*!< Test enable */
#define DDRPHYC_DLLGCR_DTC_Pos      (6U)
#define DDRPHYC_DLLGCR_DTC_Msk      (0x7U << DDRPHYC_DLLGCR_DTC_Pos)      /*!< 0x000001C0 */
#define DDRPHYC_DLLGCR_DTC          DDRPHYC_DLLGCR_DTC_Msk                /*!< Digital test control */
#define DDRPHYC_DLLGCR_DTC_0        (0x1U << DDRPHYC_DLLGCR_DTC_Pos)      /*!< 0x00000040 */
#define DDRPHYC_DLLGCR_DTC_1        (0x2U << DDRPHYC_DLLGCR_DTC_Pos)      /*!< 0x00000080 */
#define DDRPHYC_DLLGCR_DTC_2        (0x4U << DDRPHYC_DLLGCR_DTC_Pos)      /*!< 0x00000100 */
#define DDRPHYC_DLLGCR_ATC_Pos      (9U)
#define DDRPHYC_DLLGCR_ATC_Msk      (0x3U << DDRPHYC_DLLGCR_ATC_Pos)      /*!< 0x00000600 */
#define DDRPHYC_DLLGCR_ATC          DDRPHYC_DLLGCR_ATC_Msk                /*!< Analog test control */
#define DDRPHYC_DLLGCR_ATC_0        (0x1U << DDRPHYC_DLLGCR_ATC_Pos)      /*!< 0x00000200 */
#define DDRPHYC_DLLGCR_ATC_1        (0x2U << DDRPHYC_DLLGCR_ATC_Pos)      /*!< 0x00000400 */
#define DDRPHYC_DLLGCR_TESTSW_Pos   (11U)
#define DDRPHYC_DLLGCR_TESTSW_Msk   (0x1U << DDRPHYC_DLLGCR_TESTSW_Pos)   /*!< 0x00000800 */
#define DDRPHYC_DLLGCR_TESTSW       DDRPHYC_DLLGCR_TESTSW_Msk             /*!< Test switch */
#define DDRPHYC_DLLGCR_MBIAS_Pos    (12U)
#define DDRPHYC_DLLGCR_MBIAS_Msk    (0xFFU << DDRPHYC_DLLGCR_MBIAS_Pos)   /*!< 0x000FF000 */
#define DDRPHYC_DLLGCR_MBIAS        DDRPHYC_DLLGCR_MBIAS_Msk              /*!< Master bias trim */
#define DDRPHYC_DLLGCR_MBIAS_0      (0x1U << DDRPHYC_DLLGCR_MBIAS_Pos)    /*!< 0x00001000 */
#define DDRPHYC_DLLGCR_MBIAS_1      (0x2U << DDRPHYC_DLLGCR_MBIAS_Pos)    /*!< 0x00002000 */
#define DDRPHYC_DLLGCR_MBIAS_2      (0x4U << DDRPHYC_DLLGCR_MBIAS_Pos)    /*!< 0x00004000 */
#define DDRPHYC_DLLGCR_MBIAS_3      (0x8U << DDRPHYC_DLLGCR_MBIAS_Pos)    /*!< 0x00008000 */
#define DDRPHYC_DLLGCR_MBIAS_4      (0x10U << DDRPHYC_DLLGCR_MBIAS_Pos)   /*!< 0x00010000 */
#define DDRPHYC_DLLGCR_MBIAS_5      (0x20U << DDRPHYC_DLLGCR_MBIAS_Pos)   /*!< 0x00020000 */
#define DDRPHYC_DLLGCR_MBIAS_6      (0x40U << DDRPHYC_DLLGCR_MBIAS_Pos)   /*!< 0x00040000 */
#define DDRPHYC_DLLGCR_MBIAS_7      (0x80U << DDRPHYC_DLLGCR_MBIAS_Pos)   /*!< 0x00080000 */
#define DDRPHYC_DLLGCR_SBIAS2_0_Pos (20U)
#define DDRPHYC_DLLGCR_SBIAS2_0_Msk (0x7U << DDRPHYC_DLLGCR_SBIAS2_0_Pos) /*!< 0x00700000 */
#define DDRPHYC_DLLGCR_SBIAS2_0     DDRPHYC_DLLGCR_SBIAS2_0_Msk           /*!< Slave bias trim */
#define DDRPHYC_DLLGCR_SBIAS2_0_0   (0x1U << DDRPHYC_DLLGCR_SBIAS2_0_Pos) /*!< 0x00100000 */
#define DDRPHYC_DLLGCR_SBIAS2_0_1   (0x2U << DDRPHYC_DLLGCR_SBIAS2_0_Pos) /*!< 0x00200000 */
#define DDRPHYC_DLLGCR_SBIAS2_0_2   (0x4U << DDRPHYC_DLLGCR_SBIAS2_0_Pos) /*!< 0x00400000 */
#define DDRPHYC_DLLGCR_BPS200_Pos   (23U)
#define DDRPHYC_DLLGCR_BPS200_Msk   (0x1U << DDRPHYC_DLLGCR_BPS200_Pos)   /*!< 0x00800000 */
#define DDRPHYC_DLLGCR_BPS200       DDRPHYC_DLLGCR_BPS200_Msk             /*!< Bypass mode frequency range */
#define DDRPHYC_DLLGCR_SBIAS5_3_Pos (24U)
#define DDRPHYC_DLLGCR_SBIAS5_3_Msk (0x7U << DDRPHYC_DLLGCR_SBIAS5_3_Pos) /*!< 0x07000000 */
#define DDRPHYC_DLLGCR_SBIAS5_3     DDRPHYC_DLLGCR_SBIAS5_3_Msk           /*!< Slave bias trim */
#define DDRPHYC_DLLGCR_SBIAS5_3_0   (0x1U << DDRPHYC_DLLGCR_SBIAS5_3_Pos) /*!< 0x01000000 */
#define DDRPHYC_DLLGCR_SBIAS5_3_1   (0x2U << DDRPHYC_DLLGCR_SBIAS5_3_Pos) /*!< 0x02000000 */
#define DDRPHYC_DLLGCR_SBIAS5_3_2   (0x4U << DDRPHYC_DLLGCR_SBIAS5_3_Pos) /*!< 0x04000000 */
#define DDRPHYC_DLLGCR_FDTRMSL_Pos  (27U)
#define DDRPHYC_DLLGCR_FDTRMSL_Msk  (0x3U << DDRPHYC_DLLGCR_FDTRMSL_Pos)  /*!< 0x18000000 */
#define DDRPHYC_DLLGCR_FDTRMSL      DDRPHYC_DLLGCR_FDTRMSL_Msk            /*!< Slave bypass fixed delay trim */
#define DDRPHYC_DLLGCR_FDTRMSL_0    (0x1U << DDRPHYC_DLLGCR_FDTRMSL_Pos)  /*!< 0x08000000 */
#define DDRPHYC_DLLGCR_FDTRMSL_1    (0x2U << DDRPHYC_DLLGCR_FDTRMSL_Pos)  /*!< 0x10000000 */
#define DDRPHYC_DLLGCR_LOCKDET_Pos  (29U)
#define DDRPHYC_DLLGCR_LOCKDET_Msk  (0x1U << DDRPHYC_DLLGCR_LOCKDET_Pos)  /*!< 0x20000000 */
#define DDRPHYC_DLLGCR_LOCKDET      DDRPHYC_DLLGCR_LOCKDET_Msk            /*!< Master lock detect enable */
#define DDRPHYC_DLLGCR_DLLRSVD2_Pos (30U)
#define DDRPHYC_DLLGCR_DLLRSVD2_Msk (0x3U << DDRPHYC_DLLGCR_DLLRSVD2_Pos) /*!< 0xC0000000 */
#define DDRPHYC_DLLGCR_DLLRSVD2     DDRPHYC_DLLGCR_DLLRSVD2_Msk           /*!< These bit are connected to the DLL control bus and reserved for future use. */
#define DDRPHYC_DLLGCR_DLLRSVD2_0   (0x1U << DDRPHYC_DLLGCR_DLLRSVD2_Pos) /*!< 0x40000000 */
#define DDRPHYC_DLLGCR_DLLRSVD2_1   (0x2U << DDRPHYC_DLLGCR_DLLRSVD2_Pos) /*!< 0x80000000 */

/***************  Bit definition for DDRPHYC_ACDLLCR register  ****************/
#define DDRPHYC_ACDLLCR_MFBDLY_Pos  (6U)
#define DDRPHYC_ACDLLCR_MFBDLY_Msk  (0x7U << DDRPHYC_ACDLLCR_MFBDLY_Pos)  /*!< 0x000001C0 */
#define DDRPHYC_ACDLLCR_MFBDLY      DDRPHYC_ACDLLCR_MFBDLY_Msk            /*!< Master DLL feed-back delay trim */
#define DDRPHYC_ACDLLCR_MFBDLY_0    (0x1U << DDRPHYC_ACDLLCR_MFBDLY_Pos)  /*!< 0x00000040 */
#define DDRPHYC_ACDLLCR_MFBDLY_1    (0x2U << DDRPHYC_ACDLLCR_MFBDLY_Pos)  /*!< 0x00000080 */
#define DDRPHYC_ACDLLCR_MFBDLY_2    (0x4U << DDRPHYC_ACDLLCR_MFBDLY_Pos)  /*!< 0x00000100 */
#define DDRPHYC_ACDLLCR_MFWDLY_Pos  (9U)
#define DDRPHYC_ACDLLCR_MFWDLY_Msk  (0x7U << DDRPHYC_ACDLLCR_MFWDLY_Pos)  /*!< 0x00000E00 */
#define DDRPHYC_ACDLLCR_MFWDLY      DDRPHYC_ACDLLCR_MFWDLY_Msk            /*!< Master DLL feed-forward delay trim */
#define DDRPHYC_ACDLLCR_MFWDLY_0    (0x1U << DDRPHYC_ACDLLCR_MFWDLY_Pos)  /*!< 0x00000200 */
#define DDRPHYC_ACDLLCR_MFWDLY_1    (0x2U << DDRPHYC_ACDLLCR_MFWDLY_Pos)  /*!< 0x00000400 */
#define DDRPHYC_ACDLLCR_MFWDLY_2    (0x4U << DDRPHYC_ACDLLCR_MFWDLY_Pos)  /*!< 0x00000800 */
#define DDRPHYC_ACDLLCR_ATESTEN_Pos (18U)
#define DDRPHYC_ACDLLCR_ATESTEN_Msk (0x1U << DDRPHYC_ACDLLCR_ATESTEN_Pos) /*!< 0x00040000 */
#define DDRPHYC_ACDLLCR_ATESTEN     DDRPHYC_ACDLLCR_ATESTEN_Msk           /*!< Analog test enable */
#define DDRPHYC_ACDLLCR_DLLSRST_Pos (30U)
#define DDRPHYC_ACDLLCR_DLLSRST_Msk (0x1U << DDRPHYC_ACDLLCR_DLLSRST_Pos) /*!< 0x40000000 */
#define DDRPHYC_ACDLLCR_DLLSRST     DDRPHYC_ACDLLCR_DLLSRST_Msk           /*!< DLL soft reset */
#define DDRPHYC_ACDLLCR_DLLDIS_Pos  (31U)
#define DDRPHYC_ACDLLCR_DLLDIS_Msk  (0x1U << DDRPHYC_ACDLLCR_DLLDIS_Pos)  /*!< 0x80000000 */
#define DDRPHYC_ACDLLCR_DLLDIS      DDRPHYC_ACDLLCR_DLLDIS_Msk            /*!< DLL disable */

