ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157axx_ca7.h
/*****************  Bit definition for RCC_MC_CIER register  ******************/
#define RCC_MC_CIER_LSIRDYIE_Pos                  (0U)
#define RCC_MC_CIER_LSIRDYIE_Msk                  (0x1U << RCC_MC_CIER_LSIRDYIE_Pos)                 /*!< 0x00000001 */
#define RCC_MC_CIER_LSIRDYIE                      RCC_MC_CIER_LSIRDYIE_Msk                           /*!< LSI ready Interrupt Enable */
#define RCC_MC_CIER_LSERDYIE_Pos                  (1U)
#define RCC_MC_CIER_LSERDYIE_Msk                  (0x1U << RCC_MC_CIER_LSERDYIE_Pos)                 /*!< 0x00000002 */
#define RCC_MC_CIER_LSERDYIE                      RCC_MC_CIER_LSERDYIE_Msk                           /*!< LSE ready Interrupt Enable */
#define RCC_MC_CIER_HSIRDYIE_Pos                  (2U)
#define RCC_MC_CIER_HSIRDYIE_Msk                  (0x1U << RCC_MC_CIER_HSIRDYIE_Pos)                 /*!< 0x00000004 */
#define RCC_MC_CIER_HSIRDYIE                      RCC_MC_CIER_HSIRDYIE_Msk                           /*!< HSI ready Interrupt Enable */
#define RCC_MC_CIER_HSERDYIE_Pos                  (3U)
#define RCC_MC_CIER_HSERDYIE_Msk                  (0x1U << RCC_MC_CIER_HSERDYIE_Pos)                 /*!< 0x00000008 */
#define RCC_MC_CIER_HSERDYIE                      RCC_MC_CIER_HSERDYIE_Msk                           /*!< HSE ready Interrupt Enable */
#define RCC_MC_CIER_CSIRDYIE_Pos                  (4U)
#define RCC_MC_CIER_CSIRDYIE_Msk                  (0x1U << RCC_MC_CIER_CSIRDYIE_Pos)                 /*!< 0x00000010 */
#define RCC_MC_CIER_CSIRDYIE                      RCC_MC_CIER_CSIRDYIE_Msk                           /*!< CSI ready Interrupt Enable */
#define RCC_MC_CIER_PLL1DYIE_Pos                  (8U)
#define RCC_MC_CIER_PLL1DYIE_Msk                  (0x1U << RCC_MC_CIER_PLL1DYIE_Pos)                 /*!< 0x00000100 */
#define RCC_MC_CIER_PLL1DYIE                      RCC_MC_CIER_PLL1DYIE_Msk                           /*!< PLL1 ready Interrupt Enable */
#define RCC_MC_CIER_PLL2DYIE_Pos                  (9U)
#define RCC_MC_CIER_PLL2DYIE_Msk                  (0x1U << RCC_MC_CIER_PLL2DYIE_Pos)                 /*!< 0x00000200 */
#define RCC_MC_CIER_PLL2DYIE                      RCC_MC_CIER_PLL2DYIE_Msk                           /*!< PLL2 ready Interrupt Enable */
#define RCC_MC_CIER_PLL3DYIE_Pos                  (10U)
#define RCC_MC_CIER_PLL3DYIE_Msk                  (0x1U << RCC_MC_CIER_PLL3DYIE_Pos)                 /*!< 0x00000400 */
#define RCC_MC_CIER_PLL3DYIE                      RCC_MC_CIER_PLL3DYIE_Msk                           /*!< PLL3 ready Interrupt Enable */
#define RCC_MC_CIER_PLL4DYIE_Pos                  (11U)
#define RCC_MC_CIER_PLL4DYIE_Msk                  (0x1U << RCC_MC_CIER_PLL4DYIE_Pos)                 /*!< 0x00000800 */
#define RCC_MC_CIER_PLL4DYIE                      RCC_MC_CIER_PLL4DYIE_Msk                           /*!< PLL4 ready Interrupt Enable */
#define RCC_MC_CIER_LSECSSIE_Pos                  (16U)
#define RCC_MC_CIER_LSECSSIE_Msk                  (0x1U << RCC_MC_CIER_LSECSSIE_Pos)                 /*!< 0x00010000 */
#define RCC_MC_CIER_LSECSSIE                      RCC_MC_CIER_LSECSSIE_Msk                           /*!< LSE clock security system Interrupt Enable */
#define RCC_MC_CIER_WKUPIE_Pos                    (20U)
#define RCC_MC_CIER_WKUPIE_Msk                    (0x1U << RCC_MC_CIER_WKUPIE_Pos)                   /*!< 0x00100000 */
#define RCC_MC_CIER_WKUPIE                        RCC_MC_CIER_WKUPIE_Msk                             /*!< Wake up from CStop Interrupt Enable */

/*****************  Bit definition for RCC_MC_CIFR register  ******************/
#define RCC_MC_CIFR_LSIRDYF_Pos                   (0U)
#define RCC_MC_CIFR_LSIRDYF_Msk                   (0x1U << RCC_MC_CIFR_LSIRDYF_Pos)                  /*!< 0x00000001 */
#define RCC_MC_CIFR_LSIRDYF                       RCC_MC_CIFR_LSIRDYF_Msk                            /*!< LSI ready Interrupt Flag */
#define RCC_MC_CIFR_LSERDYF_Pos                   (1U)
#define RCC_MC_CIFR_LSERDYF_Msk                   (0x1U << RCC_MC_CIFR_LSERDYF_Pos)                  /*!< 0x00000002 */
#define RCC_MC_CIFR_LSERDYF                       RCC_MC_CIFR_LSERDYF_Msk                            /*!< LSE ready Interrupt Flag */
#define RCC_MC_CIFR_HSIRDYF_Pos                   (2U)
#define RCC_MC_CIFR_HSIRDYF_Msk                   (0x1U << RCC_MC_CIFR_HSIRDYF_Pos)                  /*!< 0x00000004 */
#define RCC_MC_CIFR_HSIRDYF                       RCC_MC_CIFR_HSIRDYF_Msk                            /*!< HSI ready Interrupt Flag */
#define RCC_MC_CIFR_HSERDYF_Pos                   (3U)
#define RCC_MC_CIFR_HSERDYF_Msk                   (0x1U << RCC_MC_CIFR_HSERDYF_Pos)                  /*!< 0x00000008 */
#define RCC_MC_CIFR_HSERDYF                       RCC_MC_CIFR_HSERDYF_Msk                            /*!< HSE ready Interrupt Flag */
#define RCC_MC_CIFR_CSIRDYF_Pos                   (4U)
#define RCC_MC_CIFR_CSIRDYF_Msk                   (0x1U << RCC_MC_CIFR_CSIRDYF_Pos)                  /*!< 0x00000010 */
#define RCC_MC_CIFR_CSIRDYF                       RCC_MC_CIFR_CSIRDYF_Msk                            /*!< CSI ready Interrupt Flag */
#define RCC_MC_CIFR_PLL1DYF_Pos                   (8U)
#define RCC_MC_CIFR_PLL1DYF_Msk                   (0x1U << RCC_MC_CIFR_PLL1DYF_Pos)                  /*!< 0x00000100 */
#define RCC_MC_CIFR_PLL1DYF                       RCC_MC_CIFR_PLL1DYF_Msk                            /*!< PLL1 ready Interrupt Flag */
#define RCC_MC_CIFR_PLL2DYF_Pos                   (9U)
#define RCC_MC_CIFR_PLL2DYF_Msk                   (0x1U << RCC_MC_CIFR_PLL2DYF_Pos)                  /*!< 0x00000200 */
#define RCC_MC_CIFR_PLL2DYF                       RCC_MC_CIFR_PLL2DYF_Msk                            /*!< PLL2 ready Interrupt Flag */
#define RCC_MC_CIFR_PLL3DYF_Pos                   (10U)
#define RCC_MC_CIFR_PLL3DYF_Msk                   (0x1U << RCC_MC_CIFR_PLL3DYF_Pos)                  /*!< 0x00000400 */
#define RCC_MC_CIFR_PLL3DYF                       RCC_MC_CIFR_PLL3DYF_Msk                            /*!< PLL3 ready Interrupt Flag */
#define RCC_MC_CIFR_PLL4DYF_Pos                   (11U)
#define RCC_MC_CIFR_PLL4DYF_Msk                   (0x1U << RCC_MC_CIFR_PLL4DYF_Pos)                  /*!< 0x00000800 */
#define RCC_MC_CIFR_PLL4DYF                       RCC_MC_CIFR_PLL4DYF_Msk                            /*!< PLL4 ready Interrupt Flag */
#define RCC_MC_CIFR_LSECSSF_Pos                   (16U)
#define RCC_MC_CIFR_LSECSSF_Msk                   (0x1U << RCC_MC_CIFR_LSECSSF_Pos)                  /*!< 0x00010000 */
#define RCC_MC_CIFR_LSECSSF                       RCC_MC_CIFR_LSECSSF_Msk                            /*!< LSE clock security system Interrupt Flag */
#define RCC_MC_CIFR_WKUPF_Pos                     (20U)
#define RCC_MC_CIFR_WKUPF_Msk                     (0x1U << RCC_MC_CIFR_WKUPF_Pos)                    /*!< 0x00100000 */
#define RCC_MC_CIFR_WKUPF                         RCC_MC_CIFR_WKUPF_Msk                              /*!< Wake up from CStop Interrupt Flag */

